Week_12/benchBNB/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "AaFWk9X0eZiLYyik0g6JMA"], ["updated_at", "2021-09-22 21:08:38.178556"], ["id", 6]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save