Week_6/73ea31094cf38faef387170047c7a5e8b9e3fe54/rails_olympics_production_A_skeleton 3/build_rails_project/Thong_La/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "blah@blah.com"], ["created_at", "2019-09-20 23:05:19.955365"], ["updated_at", "2019-09-20 23:05:19.955365"]]
---
    def create
        @user = User.new(user_params)

        if @user.save