Week_7/w7d5/RedditClone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator = params[:user_id]

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Big"], ["description", "For big"], ["moderator", 2], ["created_at", "2021-08-21 02:04:04.031966"], ["updated_at", "2021-08-21 02:04:04.031966"]]

    def destroy
        @sub = current_user.subs.find_by(id: params[:id])
        if @sub && @sub.delete
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 3]]

    def is_moderator?
        sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]