Week_7/w7d5/RedditClone/app/controllers/users_controller.rb

    def index
        @user = User.all
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]